import {
    Accordion,
    AccordionContent,
    AccordionItem,
    AccordionTrigger,
  } from "@/components/ui/accordion";
const AccordionService = () => {
    const data = [
        {
          id: 1,
          title: "تحویل سریع از گمرک تا انبار – حمل‌ونقل ایمن و مقرون‌به‌صرفه",
          text: "پس از ترخیص، کالاهای شما را با ناوگان حمل‌ونقل مطمئن به انبارتان منتقل می‌کنیم. تضمین سلامت و امنیت بار، یکی از تعهدات اصلی ماست.",
        },
        {
          id: 2,
          title: "ترخیص در گمرک استانبول – هوایی، زمینی، دریایی با کادر مجرب",
          text: `با همکاری ترخیص‌کاران حرفه‌ای در ترکیه، کلیه امور گمرکی را در استانبول انجام می‌دهیم. خدمات ما شامل حمل‌ونقل از مسیرهای هوایی، زمینی و دریایی با کمترین هزینه و بالاترین سرعت است.`,
        },
        {
          id: 3,
          title: "تشریفات گمرکی حرفه‌ای – عبور آسان از مراحل قانونی گمرک",
          text: "تشریفات گمرکی از جمله ارزیابی، بررسی اسناد و پرداخت حقوق ورودی را با دقت انجام می‌دهیم. تیم ما تجربه کافی برای جلوگیری از هرگونه تأخیر یا مشکل را دارد.",
        },
        {
          id: 4,
          title:" ثبت سفارش بدون دردسر – اخذ مجوزهای قانونی در کوتاه‌ترین زمان",
          text: "با تخصص در فرآیندهای اداری، ثبت سفارش کالاهای وارداتی را در کوتاه‌ترین زمان ممکن انجام می‌دهیم. ما اطمینان حاصل می‌کنیم که تمامی مراحل قانونی به‌درستی طی شود.",
        },
        {
          id: 5,
          title: "حمل‌ونقل بین‌المللی – از مبدا تا گمرک ایران با بهترین شرایط",
          text: "ما حمل و نقل بین‌المللی را از مبدا تا گمرک ایران با بهترین شرایط و هزینه انجام می‌دهیم. امنیت، سرعت و دقت در ارسال کالا، اولویت اصلی ماست.",
        },
        {
          id: 6,
          title: "ترخیص کالا از صفر تا صد – از اسناد تا تحویل درب انبار",
          text: "از دریافت اسناد تا ترخیص نهایی کالا، تمامی مراحل گمرکی را با دقت و شفافیت انجام می‌دهیم. ما موانع اداری را برطرف کرده و روند ترخیص را سریع و بدون دردسر می‌کنیم.",
        },
        {
          id: 7,
          title: "بازرگانی یاراد – همراه مطمئن شما در تجارت بین‌الملل",
          text: "از دریافت اسناد تا ترخیص نهایی کالا، تمامی مراحل گمرکی را با دقت و شفافیت انجام می‌دهیم. ما موانع اداری را برطرف کرده و روند ترخیص را سریع و بدون دردسر می‌کنیم.",
        },
        {
          id: 8,
          title:  "ترخیص کالا بدون دردسر – سریع، مطمئن و تخصصی",
          text: "شرکت ما با سال‌ها تجربه در زمینه ترخیص کالا، تمامی مراحل گمرکی را با دقت و سرعت بالا انجام می‌دهد. ما تضمین می‌کنیم که کالاهای شما بدون مشکل و در کمترین زمان ممکن از گمرک ترخیص شوند.",
        },
      ];
  return (
    
    <Accordion type="single" collapsible className="">
      {data?.map((item) => {
        return (
          <AccordionItem value={`item-${item.id}`} className="md:mt-4">
            <AccordionTrigger className="font-bold text-xl text-start">
              {item.title}
            </AccordionTrigger>
            <AccordionContent className="text-lg">{item.text}</AccordionContent>
          </AccordionItem>
        );
      })}
    </Accordion>
  
  )
}

export default AccordionService