import React from 'react'

const DesAboutTextTemplate = () => {
  return (
    <div className='flex flex-col gap-2'>

    <p className='text-xl/9    bg-opacity-80   rounded-xl p-4'>
      ترخیص کالا از گمرک از مهم ترین مراحل تجارت خارجی و بازرگانی است ، در واقع استفاده از ترخیص کار با تجربه و رعایت کردن اصول صحیح اظهار کالا در گمرک و اطلاع  از  تعرفه و ارزش صحیح کالا ، باعث کاهش چشمگیر قیمت تمام شده کالای وارداتی شده و در فضای رقابتی ، تجارتی سود اور را برای بازرگان به ارمغان خواهد اورد .
    </p>
    <p className='text-xl/9   bg-opacity-80   rounded-xl p-4'>
    شرکت ایده پرداز یاراد منطقه آزاد ماکو با بیش از 15 سال سابقه فعالیت در زمینه ترخیص کالا ، واردات و صادرات ، خدمات بازرگانی و همچنین استفاده از نیروهای با تجربه و متخصص در امور ترخیص ،  و تسلط کامل بر قوانین و مقررات گمرکی ، و با یاری خداوند متعال توانسته است اعتماد و همراهی  بازرگانان و تجار صنایع مختلف  را  کسب نماید.
    </p>
    </div>
  )
}

export default DesAboutTextTemplate