import ImageOne from "@/public/assets/image/customs_officer_2.jpg";
import ImageTow from "@/public/assets/image/59858.jpg";
import ImageThree from "@/public/assets/image/6226335.jpg";
import ImageFor from "@/public/assets/image/20945971.jpg";
import ImageFive from "@/public/assets/image/supply_16.jpg";
import Image from "next/image";
import styleAnimation from "@/style/animation.module.css";

export const itemCardHomePage = [
  {
    id: 1,
    text: {
      textContent:
        "شرکت ما با سال‌ها تجربه و تخصص در زمینه ترخیص کالا، تمامی مراحل گمرکی را با دقت و سرعت بالا انجام می‌دهد. ما تضمین می‌کنیم که کالاهای شما بدون مشکل و در کمترین زمان ممکن از گمرک ترخیص شوند. تیم ما با آشنایی کامل به قوانین و مقررات بین‌المللی و داخلی، فرآیندهای ترخیص را ساده‌تر کرده و از هرگونه تأخیر و هزینه‌های اضافی جلوگیری می‌کند. هدف ما ارائه خدماتی ایمن، سریع و مقرون‌به‌صرفه برای واردکنندگان و صادرکنندگان است.",
      textHeader: "ترخیص کالا بدون دردسر، سریع، مطمئن و تخصصی",
      textForDetailPage: `
         با استفاده از فناوری‌های جدید و سیستم مدیریتی پیشرفته، ما بهینه‌سازی
        فرآیندهای گمرکی را برای مشتریان عزیز خود انجام می‌دهیم. تیم حرفه‌ای ما
        همواره آماده پاسخگویی به سوالات شما و ارائه راهکارهای مناسب در تمامی
        مراحل واردات و صادرات است. با اعتماد به تجربه طولانی ما، می‌توانید مطمئن
        باشید که کالاهای شما در دست بهترین متخصصان قرار دارد. همچنین، خدمات
        پس‌از فروش ما نیز تضمین کامل رضایت مشتریان را در بر دارد. برای بیشترین
        راحتی شما، ما امکان دسترسی آنلاین به وضعیت ترخیص کالاها را فراهم
        کرده‌ایم. لذا می‌توانید همواره با وارد کردن اطلاعات خود، وضعیت عملیات
        گمرکی خود را به صورت زنده دنبال کنید.
      `,
    },
    image: (
      <Image
        src={ImageOne}
        alt="image-ship"
        className={` ${styleAnimation.circle}`}
        width={300}
      />
    ),
    buttonItem: {
      textButton: "مطالعه بیشتر درباره  ترخیص کالا...",
    },
    rowRevers: false,
    boxColor: "bg-white",
  },
  {
    id: 2,
    text: {
      textContent:
        "بازرگانی یاراد با تیمی متخصص و آشنا به قوانین گمرکی، خدمات جامع در حوزه واردات و صادرات ارائه می‌دهد. ما همراه شما هستیم تا تجارت بین‌المللی را آسان‌تر و کم‌ریسک‌تر کنید. از تهیه اسناد گمرکی تا حمل و نقل بین‌المللی، تمامی مراحل تجاری را به‌صورت حرفه‌ای مدیریت می‌کنیم. همکاری با شبکه گسترده‌ای از شرکای تجاری در سراسر جهان، امکان ارائه بهترین راهکارها برای کاهش هزینه‌ها و افزایش سرعت را برای شما فراهم کرده است.",
      textHeader: " بازرگانی یاراد، همراه مطمئن شما در تجارت بین‌الملل",
      textForDetailPage: `
        در بازرگانی یاراد، از فناوری‌های پیشرفته و سیستم‌های مدیریتی مدرن استفاده می‌کنیم تا عملیات تجاری شما بهینه‌تر انجام شود. امنیت ما، رضایت کامل مشتریان عزیز است، و برای دستیابی به این هدف، همواره در حال بهبود و نو‌آوری در فرآیندهای خود هستیم. تیم پشتیبانی 24 ساعته ما آماده پاسخگویی به نیازهای شماست و تمام تلاش خود را برای حل هرگونه مشکل در کوتاه‌ترین زمان ممکن صرف می‌کند. با انتخاب ما، تنها به موفقیت خود فکر کنید – ما به سایر جزئیات اطمینان می‌دهیم.
        `,
    },
    image: (
      <Image
        src={ImageTow}
        alt="image-ship"
        className={`${styleAnimation.circle}`}
        width={300}
      />
    ),
    buttonItem: {
      textButton: "مطالعه بیشتر درباره بازرگانی یارد...",
    },
    rowRevers: true,
    boxColor: "bg-none",
  },
  {
    id: 3,
    text: {
      textContent:
        "از دریافت اسناد تا ترخیص نهایی کالا، تمامی مراحل گمرکی را با دقت و شفافیت انجام می‌دهیم. ما موانع اداری را برطرف کرده و روند ترخیص را سریع و بدون دردسر می‌کنیم. تیم ما با بررسی دقیق قوانین گمرکی و ارائه راهکارهای بهینه، زمان انتظار را به حداقل رسانده و از بروز مشکلات احتمالی جلوگیری می‌کند. هدف ما ارائه خدماتی است که فرآیند ترخیص کالا را برای مشتریان آسان‌تر و بی‌دغدغه‌تر کند.",
      textHeader: "صفر تا صد ترخیص",
      textForDetailPage:`
      در بازرگانی یاراد، از فناوری‌های جدید و سیستم‌های مدیریت پیشرفته برای بهینه‌سازی فرآیندهای گمرکی استفاده می‌کنیم. ما اطمینان می‌دهیم که تمام اطلاعات شما به صورت امن ذخیره شده و در دسترس شما قرار دارد. همچنین، امکان رد و بدل کردن اطلاعات به صورت آنلاین و بدون نیاز به حضور فیزیکی، از دیگر خدمات ما است که زمان و هزینه شما را کاهش می‌دهد. با اعتماد به تجربه طولانی ما، می‌توانید مطمئن باشید که کالای شما در دست بهترین متخصصان قرار دارد.
      `
    },
    image: (
      <Image
        src={ImageThree}
        alt="image-ship"
        className={` ${styleAnimation.circle}`}
        width={300}
      />
    ),
    buttonItem: {
      textButton: "مطالعه بیشتر درباره  ترخیص کالا...",
    },
    rowRevers: false,
    boxColor: "bg-white",
  },
  {
    id: 4,
    text: {
      textContent:
        "ما حمل و نقل بین‌المللی را از مبدا تا گمرک ایران با بهترین شرایط و هزینه انجام می‌دهیم. امنیت، سرعت و دقت در ارسال کالا، اولویت اصلی ماست. با استفاده از روش‌های حمل‌ونقل هوایی، زمینی و دریایی، متناسب با نوع کالا و نیاز مشتری، بهترین مسیر را انتخاب کرده و اطمینان حاصل می‌کنیم که بار شما در کمترین زمان و با هزینه مناسب به مقصد برسد.",
      textHeader: "حمل از مبدا به گمرک ایران",
      textForDetailPage:"با استفاده از سیستم‌های مدیریتی پیشرفته، تمامی اطلاعات مربوط به سفارش‌ها را به صورت سازمان‌دهی شده و قابل دسترس نگه می‌داریم. این امر به ما اجازه می‌دهد تا هر گام از فرآیند ثبت سفارش را به طور دقیق ردیابی کنیم و مشتریان عزیز خود را در هر مرحله با جزئیات لازم آشنایی دهیم. همچنین، همکاری تنگاتنگ ما با موسسات مرتبط و ارتباط مستقیم با مقامات مربوطه، امکان حل سریع مشکلات و ارائه راهکارهای مؤثر را فراهم می‌کند. هدف ما، ایجاد یک تجربه بدون تنش برای مشتریانمان است که بتوانند تنها به توسعه کسب‌وکار خود فکر کنند."
    },
    image: (
      <Image
        src={ImageFor}
        alt="image-ship"
        className={`rounded-full ${styleAnimation.circle}`}
        width={300}
      />
    ),
    buttonItem: {
      textButton: "مطالعه بیشتر درباره حمل از مبدا...",
    },
    rowRevers: true,
    boxColor: "bg-none",
  },
  {
    id: 5,
    text: {
      textContent:
        "با تخصص در فرآیندهای اداری، ثبت سفارش کالاهای وارداتی را در کوتاه‌ترین زمان ممکن انجام می‌دهیم. ما اطمینان حاصل می‌کنیم که تمامی مراحل قانونی به‌درستی طی شود. آگاهی از تغییرات قوانین و مقررات ثبت سفارش به ما کمک می‌کند تا روند اخذ مجوزها را بدون مشکل پیش ببریم و از تأخیرهای احتمالی جلوگیری کنیم.",

      textHeader: "ثبت سفارش بدون دردسر، اخذ مجوزهای قانونی در کوتاه‌ترین زمان",
      textForDetailPage :`تیم ما با داشتن تجربه گسترده در حوزه واردات، به شما کمک می‌کند تا بهترین شرایط برای ثبت سفارش خود را ایجاد کنید. با استفاده از نرم‌افزارهای مدیریتی پیشرفته، تمامی اطلاعات سفارش‌ها را به صورت مرتب و دقیق ثبت می‌کنیم. همچنین، خدمات پشتیبانی 24 ساعته ما، اطمینان حاصل می‌دهد که هرگونه سوال یا مشکل شما در کوتاه‌ترین زمان ممکن حل شود. هدف ما، ارائه یک فرآیند ساده، سریع و بدون نگرانی برای مشتریان عزیز است.`
    },
    image: (
      <Image
        src={ImageFive}
        alt="image-ship"
        className={` ${styleAnimation.circle}`}
        width={300}
      />
    ),
    buttonItem: {
      textButton: "مطالعه بیشتر درباره مجوزهای قانونی...",
    },
    rowRevers: false,
    boxColor: "bg-white",
  },
];
