import airplane from "@/app/public/assets/image/airplane.png";
import ship from "@/app/public/assets/image/ship.png";
import tower from "@/app/public/assets/image/tower.png";
export const CarouselData = [
  {
    title: "بازرگانی یاراد، همراه مطمئن شما در تجارت بین‌الملل",
    image: tower,
    des: "از دریافت اسناد تا ترخیص نهایی کالا، تمامی مراحل گمرکی را با دقت و شفافیت انجام می‌دهیم. ما موانع اداری را برطرف کرده و روند ترخیص را سریع و بدون دردسر می‌کنیم.",
    id: 1,
    textBtn:"مطالعه بیشتر...",
    url:"/servicePage",
  },
  {
    title: "تحویل سریع از گمرک تا انبار، حمل‌ونقل ایمن و مقرون‌به‌صرفه",
    des: "پس از ترخیص، کالاهای شما را با ناوگان حمل‌ونقل مطمئن به انبارتان منتقل می‌کنیم. تضمین سلامت و امنیت بار، یکی از تعهدات اصلی ماست.",
    image: ship,
    id: 2,
  },
  {
    title: "ترخیص در گمرک استانبول، هوایی، زمینی، دریایی با کادر مجرب",
    image: airplane,
    des: `با همکاری ترخیص‌کاران حرفه‌ای در ترکیه، کلیه امور گمرکی را در استانبول انجام می‌دهیم. خدمات ما شامل حمل‌ونقل از مسیرهای هوایی، زمینی و دریایی با کمترین هزینه و بالاترین سرعت است.`,
    id: 3,
  },
];
